# -*- mode: org -*-

#+BEGIN_SRC sh :results output verbatim :exports both
make run CLASS=WeightedQuickUnionUF < ../../data/tinyUF.txt
#+END_SRC

#+RESULTS:
#+begin_example
4 3
3 8
6 5
9 4
2 1
5 0
7 2
6 1
2 components
id: [6, 2, 6, 4, 4, 6, 6, 2, 4, 4]
sz: [1, 1, 3, 1, 4, 1, 6, 1, 1, 1]
digraph {
  rankdir=BT
  0 -> 6
  1 -> 2
  2 -> 6
  3 -> 4
  5 -> 6
  7 -> 2
  8 -> 4
  9 -> 4
  {rank=same 4 6}
}

#+end_example
